In [1]:
import pandas as pd

In [3]:
data = [['Suraj','99'],["Sahi","100"]]

In [5]:
pd.DataFrame(data,columns=["Name","Marks"])

    Name Marks
0  Suraj    99
1   Sahi   100

In [7]:
data = {"a": [4,5,3],"b":[56,34,54]}

In [19]:
df=pd.DataFrame(data)
df

   a   b
0  4  56
1  5  34
2  3  54

In [23]:
import numpy as np

In [25]:
arr = np.array([[1,2],[3,4]])
df = pd.DataFrame(arr,columns=["A","B"])

In [27]:
df

   A  B
0  1  2
1  3  4

In [29]:
df = pd.read_excel("data.xlsx")

In [31]:
df

      Name      School  Marks
0    Suraj         Svm     99
1     Sahi         Svm    100
2  Anushka         Dps     97
3     Hema    Heritage     96
4     Riya  Seven Days     95
5     Deep          AA     94

In [33]:
df = pd.read_csv("data.csv")
df

      Name      School  Marks
0    Suraj         Svm     99
1     Sahi         Svm    100
2  Anushka         Dps     97
3     Hema    Heritage     96
4     Riya  Seven Days     95
5     Deep          AA     94

In [37]:
df = pd.read_json("data.json")
df

    name language
0  Suraj   Python
1   Sahi     Java